app/controllers/api/problems_controller.rb

  def create
    @problem = Problem.new(problem_params)
    @problem.submitter_id = current_user.id
    #commented out lines are from the old associations way of doing this
    # @problem.solution_cases.new(solution_case_params)
    if @problem.save!
---
INSERT INTO "problems" ("created_at", "description", "submitter_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-23 20:52:28.349608"], ["description", "triple(n)"], ["submitter_id", 1], ["title", "times three"], ["updated_at", "2014-07-23 20:52:28.349608"]]

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def show
    @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems"  WHERE "problems"."id" = ? LIMIT 1  [["id", 4]]