app/controllers/api/solutions_controller.rb

INSERT INTO "solutions" ("content", "created_at", "problem_id", "submitter_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "def tron(i)\r\n    i + i\r\nend"], ["created_at", "2014-07-24 22:52:20.824269"], ["problem_id", 3], ["submitter_id", 2], ["updated_at", "2014-07-24 22:52:20.824269"]]
---
  def create
    @solution = Solution.new(solution_params)
    @solution.submitter_id = current_user.id
    #give sort of latency
    sleep 0.8
    result = @solution.check
    if result[:success] && @solution.save

SELECT  "problems".* FROM "problems"  WHERE "problems"."id" = $1 LIMIT 1  [["id", 5]]
---
  def index
    sleep 0.8
    # This will be for all of a user's solutions
    # or for all of a problem's solutions
    @problem = Problem.find(params[:problem_id])