app/controllers/api/solution_cases_controller.rb

INSERT INTO "solution_cases" ("content", "created_at", "problem_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "triple(4) == 12"], ["created_at", "2014-07-23 20:52:28.392678"], ["problem_id", 6], ["updated_at", "2014-07-23 20:52:28.392678"]]
---
  def create
    @solution_case = SolutionCase.new(solution_case_params)
    #There was an extra check to see if it already existed... not clear why
    if @solution_case.save

SELECT "solution_cases".* FROM "solution_cases"  WHERE "solution_cases"."problem_id" IS NULL
---
  def index
    @solution_cases = SolutionCase.where(problem_id: params[:problem_id])