app/views/problems/show.html.erb

SELECT "solutions".* FROM "solutions"  WHERE "solutions"."problem_id" = ?  [["problem_id", 1]]
---
<h4>Solutions</h4>
<% @problem.solutions.each do |solution| %>