app/controllers/problems_controller.rb

  def create
    @problem = Problem.new(problem_params)
    @problem.solution_cases.new(solution_case_params)
    if @problem.save!
---
INSERT INTO "problems" ("created_at", "description", "submitter_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "solution_cases" ("content", "created_at", "problem_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "foo(n) == 25"], ["created_at", "2014-07-08 06:07:14.196518"], ["problem_id", 1], ["updated_at", "2014-07-08 06:07:14.196518"]]

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def show
    @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems"  WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]