app/controllers/solution_likes_controller.rb

INSERT INTO "solution_likes" ("created_at", "solution_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-08 06:08:37.844321"], ["solution_id", 1], ["updated_at", "2014-07-08 06:08:37.844321"], ["user_id", 1]]
---
  def create
    @solution_like = SolutionLike.new(solution_like_params)
    @solution_like.save if SolutionLike.find_by(solution_like_params).nil?