app/controllers/solutions_controller.rb

  def create
    @solution = Solution.new(solution_params)
    if @solution.save
---
INSERT INTO "solutions" ("content", "created_at", "problem_id", "submitter_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "def foo(n)\r\n  n * n\r\nend"], ["created_at", "2014-07-08 06:08:00.815277"], ["problem_id", 2], ["submitter_id", 1], ["updated_at", "2014-07-08 06:08:00.815277"]]