app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "token", "username") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$10$Yk6IaXzacHt4lyLsPY.ZGO.qCvzO58hKDne6hV1Uqd55yAK8hS7QC"], ["token", "tOy7HTHGMiI8pGgm5VMzHw"], ["username", "otto"]]
---
  def create
    @user = User.new(user_params)
    if @user.save